# DockablePane Constructor (DockablePaneId)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePane Constructor (DockablePaneId)
DockablePane Class See Also
---
Gets the pane with identifier %id%.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public DockablePane(
	DockablePaneId id
)
```

Visual Basic
---
```text
Public Sub New ( _
	id As DockablePaneId _
)
```

Visual C++
---
```text
public:
DockablePane(
	DockablePaneId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.UI..::..DockablePaneId
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | no dockable pane has been registered with identifier id. -or- the dockable pane with identifier id has not been created yet. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DockablePane Class
DockablePane Overload
Autodesk.Revit.UI Namespace